app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "details", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Essen"], ["details", "Gut"], ["completed", 0], ["created_at", "2023-02-21 15:08:44.409919"], ["updated_at", "2023-02-21 15:08:44.409919"]]
---
  def create
    @task = Task.new(task_params)
    @task.save

UPDATE "tasks" SET "details" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["details", "FAst"], ["updated_at", "2023-02-21 20:19:11.110330"], ["id", 9]]
---
  def update
    @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def find_task
    @task = Task.find(params[:id])